import { type Message } from 'ai'

import { Separator } from '@/components/ui/separator'
import { ChatMessage } from '@/components/original-chat/chat-message'

export interface ChatList {
  messages: Message[]
  username: String | undefined
  bookmarks: JSON | undefined
  feedbacks: JSON | undefined
  bookmark_page: Boolean
  chat_id: String | undefined
  user_id: String | undefined
}

export function ChatList({
  chat_id,
  messages,
  user_id,
  username,
  bookmarks,
  feedbacks,
  bookmark_page
}: ChatList) {
  if (!messages.length) {
    return null
  }

  const markdownTable = `
  **markdownTable  => مانده بدهکار موجودی ابزارآلات به تفکیک شرکتها به شرح زیر است:**

  | شناسه شرکت | مانده بدهکار (ریال)      |
  |------------|--------------------------|
  | 11         | 246,745,380,135          |
  | 9          | 116,551,392,391          |
  | 12         | 114,156,223,723          |
  | 6          | 14,175,090,651           |
  | 8          | 18,569,718,494           |
  `
  const markdownTable2 = `**مانده بدهکار موجودی ابزارآلات به تفکیک شرکتها به شرح زیر است:**        | شناسه شرکت | مانده بدهکار (ریال)      |    |------------|--------------------------|    | 11         | 42,656,619,521           |    | 9          | 30,932,598,304           |    | 12         | 39,298,191,290           |    | 8          | 4,870,847,643            |    | 6          | 2,997,772,308            |`
  const markdownTable3 = "markdownTable3 => **مانده بدهکار موجودی ابزارآلات به تفکیک شرکتها به شرح زیر است:**\n\n" +
  "| شناسه شرکت | مانده بدهکار (ریال)      |\n" +
  "|------------|--------------------------|\n" +
  "| 11         | 246,745,380,135          |\n" +
  "| 9          | 116,551,392,391          |\n" +
  "| 12         | 114,156,223,723          |\n" +
  "| 6          | 14,175,090,651           |\n" +
  "| 8          | 18,569,718,494           |\n";

  const markdownTable4 ="markdownTable4 => **مانده بدهکار موجودی ابزارآلات به تفکیک شرکتها به شرح زیر است:**\n\n| شناسه شرکت | مانده بدهکار (ریال)      |\n|------------|--------------------------|\n| 11         | 42,656,619,521           |\n| 9          | 30,932,598,304           |\n| 12         | 39,298,191,290           |\n| 8          | 4,870,847,643            |\n| 6          | 2,997,772,308            |"





  const messageWithoutId = [
    {
      role: 'user',
      content: 'سلام، میتونی شرایط ثبت شرکت رو بهم بگی؟'
    },
    {
      role: 'assistant',
      content:
        '### شرایط ثبت شرکت در ایران\n\nبه منظور ثبت شرکت در ایران، شما باید مجموعه‌ای از شرایط و مراحل قانونی را طی کنید. در ادامه شرایط و مدارک مورد نیاز برای ثبت شرکت آورده شده است:\n\n1. **انتخاب نوع شرکت**: اولین قدم انتخاب نوع شرکت است، مانند شرکت سهامی خاص، شرکت با مسئولیت محدود، و غیره.\n   \n2. **تعیین اسم شرکت**: نام شرکت باید منحصر به فرد باشد و قبلاً در اداره ثبت شرکت‌ها ثبت نشده باشد.\n\n3. **تدوین اساسنامه**: اساسنامه که شامل مجموعه قوانین اداری و حقوقی شرکت است، باید تهیه و تنظیم گردد.\n\n4. **تهیه اظهارنامه**: این سند شامل مشخصات کامل شرکت مانند نام شرکت، نوع فعالیت، سرمایه اولیه و غیره است.\n\n5. **مدارک شناسایی**: کلیه شرکا یا مدیران شرکت باید مدارک شناسایی خود را ارائه دهند.\n\n6. **محل شرکت**: آدرس دقیق محل شرکت باید مشخص شود.\n\n7. **ثبت در اداره ثبت شرکت‌ها**: پس از تکمیل مدارک بالا، باید جهت ثبت رسمی شرکت به اداره ثبت شرکت‌ها مراجعه کنید.\n\n8. **پرداخت هزینه‌های ثبتی**: هزینه‌های ثبت شرکت باید پرداخت شود که متناسب با نوع و اندازه شرکت می‌باشد.\n\nبا پیروی از این مراحل و رعایت دقیق قوانین، شما می‌توانید شرکت خود را در ایران به ثبت برسانید. این فرآیند می‌تواند بسته به نوع شرکت و پیچیدگی‌های مرتبط با آن، متفاوت باشد. توصیه می‌شود در صورت نیاز به راهنمایی بیشتر با یک وکیل متخصص تماس بگیرید.'
    },
    {
      role: 'user',
      content: 'تهیه اظهارنامه به چه صورت هست'
    },
    {
      role: 'assistant',
      content:
        '### تهیه اظهارنامه برای ثبت شرکت در ایران\n\nاظهارنامه یکی از اسناد مهم در فرایند ثبت شرکت در ایران است. در این سند، اطلاعات کلیدی و اساسی شرکت که در فرآیند ثبت آن لازم است، ثبت می‌شود. در ادامه به شرح مراحل تهیه اظهارنامه پرداخته‌ام:\n\n1. **اطلاعات شرکت**: اظهارنامه باید شامل نام کامل شرکت، نوع فعالیت، محل دقیق شرکت، میزان سرمایه اولیه و سهم‌الشراکه هر یک از شرکا باشد.\n\n2. **مشخصات شرکا و مدیران**: اطلاعات کامل شناسایی تمام شرکا یا به تعداد لازم و مدیران شرکت باید در اظهارنامه ثبت شود. این مشخصات شامل نام، نام خانوادگی، شماره شناسنامه، کد ملی، آدرس دقیق و سایر اطلاعات فردی مرتبط است.\n\n3. **تاییدیه‌ها و امضاها**: پس از ثبت و تنظیم اطلاعات، اظهارنامه باید توسط کلیه شرکا و مدیران شرکت امضا شود. این امضاء به منزله تاییدیه ای بر دقت و صحت اطلاعات ارائه شده است.\n\n4. **ثبت نهایی**: اظهارنامه ثبت شده باید به همراه سایر مستندات لازم به اداره ثبت شرکت‌ها ارائه شود تا فرآیند ثبت شرکت به صورت رسمی انجام گیرد.\n\n5. **هزینه‌های مربوطه**: به همراه اظهارنامه، باید هزینه‌های دولتی مرتبط با ثبت شرکت نیز پرداخت شود. این هزینه‌ها ممکن است بسته به نوع شرکت و حجم سرمایه آن متفاوت باشد.\n\nتکمیل دقیق و صحیح اظهارنامه بسیار مهم است، زیرا هرگونه خطا یا نقص در اطلاعات می‌تواند منجر به تاخیر یا عدم پذیرش ثبت شرکت شود. بهتر است قبل از تکمیل نهایی، با یک مشاور حقوقی یا کارشناس ثبت شرکت‌ها مشورت نمایید تا از صحت اطلاعات و رعایت تمامی جوانب اطمینان حاصل کنید.'
    },
    {
      role: 'user',
      content: 'اظهارنامه چی هست اصلا؟'
    },
    {
      role: 'assistant',
      content:
        'اظهارنامه در فرایند ثبت شرکت یک سند مهم است که شامل اطلاعات اساسی و کلیدی شرکت می‌شود. در اظهارنامه، مشخصات دقیق شرکت از جمله نام کامل شرکت، نوع فعالیت، محل شرکت، میزان سرمایه اولیه، و سهم‌الشراکه هر یک از شرکا ثبت می‌گردد. این سند همچنین باید شامل مشخصات کامل شناسایی شرکا و مدیران شرکت باشد تا علاوه بر شناسایی صحیح افراد مرتبط با شرکت، تایید و امضای آن‌ها نیز درج شود. اظهارنامه پس از تکمیل و امضا، به اداره ثبت شرکت‌ها ارائه می‌شود تا فرآیند ثبت با قانونیت تکمیل و تأیید شود.'
    },
    {
      role: 'user',
      content: 'شرکت استارتاپی خودم رو چطور ثبت کنم'
    },
    {
      role: 'assistant',
      content:
        'برای ثبت شرکت استارتاپی در ایران، مراحل و مدارک خاصی لازم است که باید به طور دقیق رعایت شوند. در زیر مراحل ویژه برای شروع فرایند ثبت شرکت استارتاپی شما آورده شده است:\n\n1. **تعیین نوع شرکت**: معمولاً برای استارتاپ‌ها، شرکت‌های سهامی خاص یا با مسئولیت محدود پیشنهاد می‌شود. تفاوت‌هایی در قوانین و مقررات وجود دارد که باید بررسی شوند.\n\n2. **انتخاب نام شرکت**: نام شرکت باید منحصربه‌فرد باشد و تاییدیه اداره ثبت شرکت‌ها را دریافت کرده باشد.\n\n3. **تنظیم اساسنامه و شرکت‌نامه**: این اسناد باید به دقت تنظیم شوند و جزئیات مربوط به سهامداران، میزان سرمایه، محل شرکت و غیره را مشخص کنند.\n\n4. **تامین سرمایه اولیه**: برای ثبت شرکت، نیاز به تامین سرمایه اولیه وجود دارد. میزان این سرمایه بسته به نوع شرکت متفاوت است.\n\n5. **ثبت شرکت در اداره ثبت شرکت‌ها**: با آماده سازی مدارک لازم، باید نزد اداره ثبت شرکت‌ها اقدام نمایید. این مرحله شامل تحویل مدارک و پرداخت هزینه‌های ثبت می‌باشد.\n\n6. **اخذ مجوزهای لازم**: برخی از فعالیت‌های تجاری برای شروع به کار نیاز به دریافت مجوز از ارگان‌ها و نهادهای خاص دارند.\n\n7. **ثبت نهایی و دریافت شناسه ملی**: پس از تأییدیه اداره ثبت شرکت‌ها، شناسه ملی برای شرکت صادر می‌شود و شرکت رسماً قابل شناسایی خواهد بود.\n\n8. **اخذ دفترچه رسمی و شروع فعالیت**: پس از اتمام فرایندهای ثبت، می‌توانید دفترچه‌های قانونی شرکت را تهیه و به ثبت رویدادهای مالی بپردازید.\n\nاین فرایند می‌تواند پیچیده و زمان‌بر باشد، بنابراین ممکن است لازم باشد تا از یک وکیل یا مشاور حقوقی کمک بگیرید تا از انجام صحیح تمامی مراحل اطمینان حاصل کنید. همچنین، می‌توانید از سامانه‌های آنلاین موجود برای ثبت شرکت استفاده کنید که روند کار را تسریع بخشیده و اغلب هزینه‌ها را کاهش می‌دهد.'
    }
  ]

  const msgTable = [
    {
        id: "05ed25b2-a6b2-4545-912f-8355cf4e1a7a",
        content: "سلام یک فاکتور مانده بدهکار  میخواهم به صورت جدول",
        role: "user",
    },
    {
      id: "CN1S4wT",
      createdAt: "2024-08-20T13:34:02.206Z",
      content: markdownTable,
      role: "assistant",
    },
    {
        id: "05ed25b2-a6b2-4545-912f-8355cf4e1a7a",
        content: "علی جان این فایل رو تو اسکایپ برام فرستادی",
        role: "user",
    },
    {
        id: "YYZy3Ho",
        createdAt: "2024-08-20T13:35:08.201Z",
        content: markdownTable2,
        role: "assistant",
      },
    {
      id: "05ed25b2-a6b2-4545-912f-8355cf4e1a7a",
        content: "سلام",
        role: "user",
      },
      {
        id: "XMMFFCw",
        createdAt: "2024-08-20T13:35:56.462Z",
        content: markdownTable3,
        role: "assistant",
    },
    {
      id: "05ed25b2-a6b2-4545-912f-8355cf4e1a7a",
      content: "این فرمت ویرایش شده و به نظرم مارک دان اش درسته",
      role: "user",
    },
    {
      id: "1pNaHS9",
      createdAt: "2024-08-20T13:38:23.054Z",
      content: markdownTable4,
      role: "assistant",
    },
    // {
      //     id: "1pNaHS9",
      //     createdAt: "2024-08-20T13:38:23.054Z",
    //     content:
    //         "مانده بدهکار موجودی ابزارآلات به تفکیک شرکتها به شرح زیر است:        | شناسه شرکت | مانده بدهکار (ریال)      |    |------------|--------------------------|    | 11         | 246,745,380,135          |    | 9          | 116,551,392,391          |    | 12         | 114,156,223,723          |    | 6          | 14,175,090,651           |    | 8          | 18,569,718,494           |",
    //     role: "assistant",
    // },
];

const newMessages = true ? msgTable: messageWithoutId;

  return (
    <div className="relative mx-auto max-w-2xl px-4">
      {newMessages.map((message, index) => (
        <div key={index}>
          <ChatMessage
            chat_id={chat_id}
            message={message}
            index={index}
            user_id={user_id}
            username={username}
            bookmarks={bookmarks}
            feedbacks={feedbacks}
            bookmark_page={bookmark_page}
          />
          {index < newMessages.length - 1 && index % 2 != 0 && index >= 1 && (
            <Separator className="my-4 md:my-8" />
          )}
        </div>
      ))}
    </div>
  )
}
